JOINING DATAFRAME

In [ ]:
import pandas as pd
data1={'Name':['nick','rose','jack'],
       'Dept':['AI','IT','ML']}
data2={'Score':[67,48,34],
       'age':[15,26,34]}
df=pd.DataFrame(data1,index=['k0','k1','k2'])
df1=pd.DataFrame(data2,index=['k2','k3','k4'])
print(df,"\n\n",df1)
res=df1.join(df)
print(res)

    Name Dept
k0  nick   AI
k1  rose   IT
k2  jack   ML

     Score  age
k2     67   15
k3     48   26
k4     34   34
    Score  age  Name Dept
k2     67   15  jack   ML
k3     48   26   NaN  NaN
k4     34   34   NaN  NaN

In [ ]:
import pandas as pd
data1={'index1':['k0','k1','k2'],
       'Name':['nick','rose','jack']}
data2={'index2':['k2','k3','k4'],
       'Score':[67,48,36]}
df=pd.DataFrame(data1)
df1=pd.DataFrame(data2)
print(df,"\n\n",df1)
res=df.join(df1)
print(res)

  index1  Name
0     k0  nick
1     k1  rose
2     k2  jack

   index2  Score
0     k2     67
1     k3     48
2     k4     36
  index1  Name index2  Score
0     k0  nick     k2     67
1     k1  rose     k3     48
2     k2  jack     k4     36

CONCATENATING DATAFRAME

In [ ]:
import pandas as pd
data1={'Name':['nick','rose','jack'],
       'Dept':['AI','IT','ML']}
data2={'Score':[67,48,34],
       'age':[15,26,34]}
df=pd.DataFrame(data1,index=[0,1,2])
df1=pd.DataFrame(data2,index=[3,4,5])
print(df,"\n\n",df1)
frames=[df,df1]
res=pd.concat(frames)
print(res)

   Name Dept
0  nick   AI
1  rose   IT
2  jack   ML

    Score  age
3     67   15
4     48   26
5     34   34
   Name Dept  Score   age
0  nick   AI    NaN   NaN
1  rose   IT    NaN   NaN
2  jack   ML    NaN   NaN
3   NaN  NaN   67.0  15.0
4   NaN  NaN   48.0  26.0
5   NaN  NaN   34.0  34.0

appending dataframes

In [ ]:
import pandas as pd
data1={'Name':['nick','rose','jack','john'],
       'Dept':['AI','IT','ML','DS'],
       'Score':[45,98,100,68]}
data2={'Name':['joe','noua','ryaan','jublie'],
       'dept':['CSE','Mech','Agri','biotech'],
       'Score':[67,48,36,58]}
df=pd.DataFrame(data1)
df1=pd.DataFrame(data2)
print(df,"\n\n",df1)
res=pd.concat([df,df1], ignore_index=True)
print(res)

   Name Dept  Score
0  nick   AI     45
1  rose   IT     98
2  jack   ML    100
3  john   DS     68

      Name     dept  Score
0     joe      CSE     67
1    noua     Mech     48
2   ryaan     Agri     36
3  jublie  biotech     58
     Name Dept  Score     dept
0    nick   AI     45      NaN
1    rose   IT     98      NaN
2    jack   ML    100      NaN
3    john   DS     68      NaN
4     joe  NaN     67      CSE
5    noua  NaN     48     Mech
6   ryaan  NaN     36     Agri
7  jublie  NaN     58  biotech